---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPAnalyticalNode.Dispose
source: html/fab4ed2e-967d-783e-ce79-5ded061b11b9.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalNode.Dispose Method

Releases all resources used by the MEPAnalyticalNode

## Syntax (C#)
```csharp
public void Dispose()
```